#한줄 주석 
-- 한줄 주석 (띄어쓰기)

/*
	데이터 [자료] , 베이스:[모음]
    데이버베이스 : 자료모임
     
    종류
    1. 계층형 데이터베이스 			:트리
    2. 네트워크형 데이터베이스		:양방향
    3. *관계형 데이터베이스			:행/열 테이블[표] 간의 관계
    4. Nosql 데이터베이스 			:key-value
    
    DBMS 데이터베이스 관리 시스템 (mysql, oracle, access , mssql)
    
    DBA: 데이터베이스 관리자(개발자)
    
    DB[DBserver] 	<--------- DBSM			<------		DBA
		- 학원PC 			   DB관리 시스템			- sql[질의어]
        - 데이터를 저장			   DB 서버에 접속
        - 메모리[기계어/16진수]	   표준 SQL
	
    예)
		DBA[표 만들어줘 ]	----> DBMS[표만들어줘 --> 기계어 ] ----> DB[표 만들기 성공]
								메모리1  메모리2					메모리1~4
                                메모리3  메모리4					
        

*/